Repository: Fr0oZzFred/CyberBattle
Catalog: Content/Localization/Game/*/Game.po
Languages: fr

# ST_Bonus,BouncyShot
source: Bouncy Shot
fr: Balle Rebondissante

# ST_Bonus,GhostShot
source: Ghost Shot
fr: Balle Fantomatique

# ST_Bonus,MadControl
source: Mad Control
fr: Hors de Contrôle

# ST_Bonus,Shield
source: Shield
fr: Bouclier

# ST_Bonus,TargetShot
source: Super Target Shot
fr: Super Tir Ciblé

# ST_Divers,BattleOver
source: Battle Over
fr: Combat Fini

# ST_Divers,Destroy
source: Destroy your opponent Station !
fr: Détruisez la station adverse !

# ST_Divers,PlayerAdvantage
source: Player {Index} have the advantage !
fr: Joueur {Index} a l'avantage !

# ST_Divers,Ready
source: Ready
fr: Prêt

# ST_Divers,Skip
source: Skip
fr: Passer

# ST_Divers,Welcome
source: Welcome To Cyber Arena
fr: Bienvenue dans la Cyber Arena

# ST_Divers,Winner
source: The Winner is
fr: Le gagnant est

# ST_PlayerData,CharDesEdele
source: An extravagant ex-champion of strategy game, unmotivated of winning, he try a new interest in the Cyber Battle and exploit his talent of tactician to become a perfect winner.
fr: Un ancien champion de jeu de stratégie, lasser de toujours gagner il s'est reconvertit dans le Cyber Battle pour exploiter ses talents de tacticien pour devenir l'ultime gagnant.

# ST_PlayerData,CharDesN1B0
source: An android created by a slacker to do his chores, he inherited his personality and also creates automation systems. The Cyber Battle is an opportunity to laze the rest of his life.
fr: Un android crée par un flemmard qui a hérité de sa personnalité. Il crée des mécanisme d'automatisation pour se simplifier la vie. Il participe au Cyber Battle pour paresser le reste de sa vie.

# ST_PlayerData,CharDesSatoshi
source: A serious scientist and astronomer, he's a planets lovers. His goal is to create an artificial black hole. He participates in the Cyber Battle to test his inventions, his black hole in particular.
fr: Un scientifique spécialisé dans l'astronomie, il adore les planètes. son objectif est de créer un trou noir artificiel. S'il participe au Cyber Battle, c'est pour tester ses inventions.

# ST_PlayerData,TauntN1B0
source: Boring
fr: Ennuyant

# ST_PlayerData,TauntSatoshi
source: Predictable
fr: Prévisible

# ST_PlayerData,UltDesEdele
source: Call Bombers and Fighters
fr: Appelle des vaissaux et des bombardiers

# ST_PlayerData,UltDesN1B0
source: Auto Aim Temporaly
fr: Auto-Visée Temporaire

# ST_PlayerData,UltDesSatoshi
source: Generate a Black Hole
fr: Génère un Trou Noir

# ST_PlayerData,UltNameN1B0
source: No Pain But Gain
fr: Bénéfice sans Effort

# ST_PlayerSelection,BattleSettings
source: Battle Settings
fr: Paramètres de combat

# ST_PlayerSelection,ChampionDescription
source: Champion Description
fr: Description de champion

# ST_PlayerSelection,Cooldown
source: Cooldown : {Cooldown}s
fr: Recharge : {cooldown}s

# ST_PlayerSelection,Details
source: SELECT YOUR CHAMPION AND CUSTOMIZE YOUR FIGHTER !
fr: CHOISISSEZ VOTRE CHAMPION ET MODIFIEZ VOTRE VAISSEAU !

# ST_PlayerSelection,Duration
source: Duration : {Duration}s
fr: Durée : {duration}s

# ST_PlayerSelection,P1Switch
source: P1 wants to switch
fr: J1 veut changer de côté

# ST_PlayerSelection,P2Switch
source: P2 wants to switch
fr: J2 veut changer de côté

# ST_PlayerSelection,PlayerSelection
source: Player Selection !
fr: Sélection des joueurs

# ST_PlayerSelection,Random
source: Random
fr: Aléatoire

# ST_PlayerSelection,Ready!
source: Ready !!
fr: Prêt !!

# ST_PlayerSelection,Ready?
source: Ready ?
fr: Prêt ?

# ST_PlayerSelection,Select
source: Select
fr: Sélection

# ST_PlayerSelection,SelectChampion
source: Select your Champion
fr: Choisissez votre champion

# ST_PlayerSelection,SelectSkills
source: Select your Skills
fr: Choisissez vos compétences

# ST_PlayerSelection,SwitchSide
source: Switch Side
fr: Changement de côté

# ST_SettingsPause,ActiveBonus
source: Active Bonus
fr: Bonus actifs

# ST_SettingsPause,Back
source: Back
fr: Retour

# ST_SettingsPause,BonusSettings
source: Bonus Settings
fr: Paramètres des bonus

# ST_SettingsPause,MainMenu
source: Main Menu
fr: Menu Principal

# ST_SettingsPause,PlayerSelection
source: Player Selection
fr: Sélection des joueurs

# ST_SettingsPause,Resume
source: Resume
fr: Reprendre

# ST_Skills,BlocBarrier
source: Bloc Barrier
fr: Barrière de Blocs

# ST_Skills,BlocBarrierDes
source: Spawn 3 blocs in front of your fighter.
fr: Fait apparaître 3 blocs en face de votre vaisseau.

# ST_Skills,ImpulseWave
source: Impulse Wave
fr: Vague d'Impulsion

# ST_Skills,ImpulseWaveDes
source: Create an explosion around your fighter. Push and Stun any other fighter in range.
fr: Crée une explosion autour de votre vaisseau. Repousse et paralyse le vaisseau adverse dans la portée.

# ST_Skills,Invincibility
source: Invincibility
fr: Invincibilité

# ST_Skills,InvincibilityDes
source: Renders your fighter impervious to every attacks.
fr: Votre vaisseau est invulnérable à n'importe quelle attaque.

# ST_Skills,IonicWave
source: Ionic Wave
fr: Vague Ionique

# ST_Skills,IonicWaveDes
source: Create an explosion around your fighter. Explode anything in range.
fr: Crée une explosion autour de votre vaisseau. Détruit tout dans sa portée.

# ST_Skills,MineLayer
source: Mine Layer
fr: Mine

# ST_Skills,MineLayerDes
source: Spawn a mine at your fighter position. Explode if anything else than you hit it.
fr: Pose une mine à la position de votre vaisseau.

# ST_Skills,Mirror
source: Mirror
fr: Miroir

# ST_Skills,MirrorDes
source: Create a following wall in front of your fighter. Reflect your opponent projectile.
fr: Crée un miroir en face de votre vaisseau. Réflecte les tirs adverses.

# ST_Skills,TimedOgive
source: Timed Ogive
fr: Ogive à retardement

# ST_Skills,TimedOgiveDes
source: Shot a Huge Missile in front of you. Explode in a medium range when it hits anything.
fr: Tir un gros missile dans votre direction. Explose au premier impacte.

# ST_UMGMainMenu,Credits
source: Credits
fr: Crédits

# ST_UMGMainMenu,IA
source: Play VS IA !
fr: Jouer contre l'IA !

# ST_UMGMainMenu,Play
source: Play !
fr: Jouer !

# ST_UMGMainMenu,Quit
source: Quit
fr: Quitter

# ST_UMGMainMenu,Settings
source: Settings
fr: Paramètres

# ST_UMGMainMenu,Tutorial
source: Tutorial
fr: Tutoriel
